In [1]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#Create a mew dataframe from a python dictionary
data = {
    'Name': ['John', 'Jane', 'Michael', 'Emily', 'David'],
    'Math': [85, 92, 78, np.nan, 88], #Notice that Emily's Math score is null
    'Science': [78, 45, 85, 91, 82] #There is a failing score in the science column
}

df = pd.DataFrame(data);

df

      Name  Math  Science
0     John  85.0       78
1     Jane  92.0       45
2  Michael  78.0       85
3    Emily   NaN       91
4    David  88.0       82

In [2]:
#descriptive statistics on the data
df.describe()

            Math    Science
count   4.000000   5.000000
mean   85.750000  76.200000
std     5.909033  18.074844
min    78.000000  45.000000
25%    83.250000  78.000000
50%    86.500000  82.000000
75%    89.000000  85.000000
max    92.000000  91.000000

In [3]:
#Accessing a specific column
math_column = df['Math']
science_column = df['Science']

math_column

0    85.0
1    92.0
2    78.0
3     NaN
4    88.0
Name: Math, dtype: float64

In [4]:
#filter the data
failing_science = df[df['Science'] < 50]
failing_science

   Name  Math  Science
1  Jane  92.0       45

In [5]:
#sort the data
sorted_math_values = df.sort_values(by='Math', ascending=True)

sorted_math_values

      Name  Math  Science
2  Michael  78.0       85
0     John  85.0       78
4    David  88.0       82
1     Jane  92.0       45
3    Emily   NaN       91

In [6]:
#adding a new column
df['Total Score'] = df['Math'] + df['Science']

df

      Name  Math  Science  Total Score
0     John  85.0       78        163.0
1     Jane  92.0       45        137.0
2  Michael  78.0       85        163.0
3    Emily   NaN       91          NaN
4    David  88.0       82        170.0

In [7]:
#Update data
df.loc[df['Name'] == 'Emily', 'Math'] = '12'

df

      Name  Math  Science  Total Score
0     John  85.0       78        163.0
1     Jane  92.0       45        137.0
2  Michael  78.0       85        163.0
3    Emily    12       91          NaN
4    David  88.0       82        170.0

In [8]:
#Group data and calculate the mean of numeric columns
grouped = df.groupby('Math').mean(numeric_only=True)
grouped

      Science  Total Score
Math
78.0     85.0        163.0
85.0     78.0        163.0
88.0     82.0        170.0
92.0     45.0        137.0
12       91.0          NaN

In [9]:
#locating data
michael_science_score = df.loc[df['Name'] == 'Michael', 'Science']
michael_science_score

2    85
Name: Science, dtype: int64

In [10]:
#locate data by index position
third_row = df.iloc[2]
third_row

Name           Michael
Math              78.0
Science             85
Total Score      163.0
Name: 2, dtype: object

In [11]:
#create an empty array and append data from df to it
row_data = []

#same as for item in items, but we are using built-in iterrows() method
for index, row in df.iterrows():
    row_data.append((index, row['Math'], row['Science'], row['Name']))
    
row_data

[(0, 85.0, 78, 'John'),
 (1, 92.0, 45, 'Jane'),
 (2, 78.0, 85, 'Michael'),
 (3, '12', 91, 'Emily'),
 (4, 88.0, 82, 'David')]

In [ ]:
#data
names = df['Name']
math_scores = df['Math']
science_scores = df['Science']

#plot the data
plt.plot(names, math_scores, label="Math Scores", marker="o")
plt.plot(names, science_scores, label="Science Scores", marker="o")
plt.xlabel('Name')
plt.ylabel('Scores')
plt.legend()
plt.show()